---------------------------------------------------------------------
-- 1. Начало рабочей нагрузки
-- Откройте Powershell от имени администратора, перейдите в папку ..Tuning-SqlServer-Databases\mod01\lab
-- Выполните скрипт .\start-load-ex.ps1 load-script1.sql
-- Скрипт ps запустит 10 фоновых работ (job), выполняющих один и тот же скрипт load-script1.sql
---------------------------------------------------------------------

---------------------------------------------------------------------
-- 2. Напишите запрос, возвращающий планировщиков ONLINE (VISIBLE ONLINE). Выполните этот запрос несколько раз
-- Значения в каких столбцах меняются?
---------------------------------------------------------------------



---------------------------------------------------------------------
-- 3. Напишите запрос, возвращающий информацию об активных запросах 
-- Исключите session_id <= 50
-- Какой тип ожидания?
---------------------------------------------------------------------




---------------------------------------------------------------------
-- 4. Остановите нагрузку, удалив таблицу ##stopload1
---------------------------------------------------------------------
IF OBJECT_ID('tempdb..##stopload1') IS NULL
	CREATE TABLE ##stopload1 (id int)