
---------------------------------------------------------------------
-- 1. Напишите запрос, очищающий статистику ожиданий (SQLPERF)
---------------------------------------------------------------------


---------------------------------------------------------------------
-- 2. Напишите запрос, возвращающий статистику ожиданий
-- Большинство значений 0
---------------------------------------------------------------------


---------------------------------------------------------------------
-- 3. Начало рабочей нагрузки
-- Откройте Powershell от имени администратора, перейдите в папку ..Tuning-SqlServer-Databases\mod01\lab
-- Выполните скрипт .\start-load-ex.ps1 load-script2.sql
-- Скрипт ps запустит 10 фоновых работ (job), выполняющих один и тот же скрипт load-script2.sql
---------------------------------------------------------------------

---------------------------------------------------------------------
-- 4. Напишите запрос, возвращающий список ожиданий (исключить session_id <= 50)
-- Какие типы ожиданий?
---------------------------------------------------------------------



---------------------------------------------------------------------
-- 5. Выполните запрос для записи текущей статистики во временную таблицу #wait_stats_snapshot
---------------------------------------------------------------------
SELECT *
INTO #wait_stats_snapshot
FROM sys.dm_os_wait_stats;


-- 6. Выполните запрос, который сравнивает снимок в #wait_stats_snapshot с текущей статистикой ожиданий
-- Упорядочить по разнице между wait_time_ms снимка и wait_time_ms текущим
-- Исключить результаты, где нет изменений
SELECT ws.* 
FROM #wait_stats_snapshot AS snap
JOIN sys.dm_os_wait_stats AS ws
ON ws.wait_type = snap.wait_type;

---------------------------------------------------------------------
-- 4. Остановите нагрузку, создав таблицу ##stopload2
---------------------------------------------------------------------
CREATE TABLE ##stopload2 (id int)